<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads ScreenSteps Installer for Mac</string>
	<key>Identifier</key>
	<string>com.github.dansdrivers.autopkg-recipes.download.ScreenSteps</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScreenSteps</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.bluemangolearning.com/download/screensteps/4_0/release/ScreenSteps.dmg</string>
		
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>ScreenSteps.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/ScreenSteps.dmg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Code 42 Software</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
